app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs" ORDER BY created_at DESC
---
	def index
		@docs = Doc.all.order("created_at DESC")

INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
	def create
		@doc = Doc.new(doc_params)

		if @doc.save

UPDATE "docs" SET "title" = ?, "updated_at" = ? WHERE "docs"."id" = ?  [["title", "hello qqqqqq"], ["updated_at", 2016-10-20 02:51:44 UTC], ["id", 5]]
---
	def update
		if @doc.update(doc_params)

DELETE FROM "docs" WHERE "docs"."id" = ?  [["id", 4]]
---
	def destroy
		@doc.destroy

SELECT  "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def find_doc
		@doc = Doc.find(params[:id])