app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs" WHERE "docs"."user_id" = 1
---
	def index
		@docs = Doc.where(user_id: current_user)